        IDENTIFICATION DIVISION.
        PROGRAM-ID. COBOLTUT.
        AUTHOR. DAVID
        DATE-WRITTEN. 04/05/2020
        ENVIRONMENT DIVISION.
        
        DATA DIVISION.
        
        FILE SECTION.
        
        WORKING-STORAGE SECTION.
       
        PROCEDURE DIVISION.
     
        STOP RUN.
        
